cf/Enums/ВидыРасчетаВеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыРасчетаВеса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУпаковкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТоварам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Инвойс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Инвойс</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыИмпорт</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПоставщиковВПути</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаВеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЗакупкаИмпорт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыПакинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиПоставщика</v8:Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураДляТаможни</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДляТаможни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/ДанныеНоменклатуры/Ext/Module.bsl
Процедура ЗаполнениеЮнитПакНоменклатуры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Инвойс.Ссылка,
	|	Инвойс.РасчетВеса
	|ПОМЕСТИТЬ ВТ_Инвойс
	|ИЗ
	|	Документ.Инвойс КАК Инвойс
	|ГДЕ
	|	Инвойс.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Инвойс.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Номенклатура.Артикул) КАК Артикул,
	|	ИнвойсТоварыПакинг.Номенклатура,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Цена) КАК Цена,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Номенклатура.Наименование) КАК Наименование,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.НоменклатураДляТаможни) КАК НоменклатураДляТаможни,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Количество) КАК Количество,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.КоличествоВУпаковке) КАК КоличествоВУпаковке,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.КоличествоМест) КАК КоличествоМест,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесНетто) КАК ВесНеттоУпаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесБрутто) КАК ВесБруттоУпаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесНетто * ИнвойсТоварыПакинг.КоличествоМест) КАК ВесНеттоИтогУпаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесБрутто * ИнвойсТоварыПакинг.КоличествоМест) КАК ВесБруттоИтогУпаковка,
	|	ИнвойсТоварыПакинг.Ссылка.РасчетВеса = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаВеса.ПоУпаковкам) КАК Исключение
	|ПОМЕСТИТЬ Пакинг
	|ИЗ
	|	Документ.Инвойс.ТоварыПакинг КАК ИнвойсТоварыПакинг
	|ГДЕ
	|	ИнвойсТоварыПакинг.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Инвойс.Ссылка
	|			ИЗ
	|				ВТ_Инвойс КАК ВТ_Инвойс)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвойсТоварыПакинг.Номенклатура,
	|	ИнвойсТоварыПакинг.Ссылка.РасчетВеса = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаВеса.ПоУпаковкам)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ИнвойсТоварыПакинг.Упаковка) < 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пакинг.Артикул,
	|	Пакинг.Номенклатура,
	|	Пакинг.Цена,
	|	Пакинг.Наименование,
	|	Пакинг.НоменклатураДляТаможни,
	|	Пакинг.Количество,
	|	Пакинг.Упаковка,
	|	Пакинг.КоличествоВУпаковке,
	|	Пакинг.КоличествоМест,
	|	Пакинг.ВесНеттоУпаковка,
	|	Пакинг.ВесБруттоУпаковка,
	|	Пакинг.ВесНеттоИтогУпаковка,
	|	Пакинг.ВесБруттоИтогУпаковка,
	|	Пакинг.Исключение
	|ИЗ
	|	Пакинг КАК Пакинг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Номенклатура.Артикул,
	|	Док.Номенклатура,
	|	Док.Цена,
	|	Док.Номенклатура.Наименование,
	|	Док.НоменклатураДляТаможни,
	|	Док.Количество,
	|	Док.Упаковка,
	|	Док.КоличествоВУпаковке,
	|	Док.КоличествоМест,
	|	Док.ВесНетто,
	|	Док.ВесБрутто,
	|	Док.ВесНетто * Док.КоличествоМест,
	|	Док.ВесБрутто * Док.КоличествоМест,
	|	Док.Ссылка.РасчетВеса = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаВеса.ПоУпаковкам)
	|ИЗ
	|	Документ.Инвойс.ТоварыПакинг КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Пакинг КАК Пак
	|		ПО (Пак.Номенклатура = Док.Номенклатура)
	|ГДЕ
	|	Док.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Инвойс.Ссылка
	|			ИЗ
	|				ВТ_Инвойс КАК ВТ_Инвойс)
	|	И Пак.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пакинг.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоменклатураОбъект = Выборка.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.Юнитпак = Выборка.КоличествоВУпаковке;
		НоменклатураОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
